# read design 

#read_verilog ../CPU/cpu.v
#read_verilog ../ALU/alu.v
#read_verilog ../mem/im.v
read_verilog ../RF/reg_file.v
#read_verilog ../control/control2.v
# elaborate design hierarchy
hierarchy 
#-check -top alu -libdir ../ALU -libdir ../lib 

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# write synthesized design
write_verilog synth.v
show -format ps -viewer gv
